
Процедура КнопкаВыполнитьНажатие(Кнопка)
	Запрос = Новый Запрос;
	Запрос.Текст = СокрЛП(ТекстЗ);
	Рез = Запрос.Выполнить();
	Выборка = Рез.Выбрать();
	Кол = 0;
	Пока Выборка.Следующий() Цикл
		СтарыйКод = Выборка.Код;
		СпрО = Выборка.Ссылка.ПолучитьОбъект();
		СпрО.УстановитьНовыйКод(СокрЛП(Преф));
		СпрО.ОбменДанными.Загрузка = Истина;
		НовыйКод = СпрО.Код;
		СпрО.Записать();
		Кол = Кол + 1;
		Сообщить("Код был: " + Строка(СтарыйКод) + ", код стал: " + Строка(НовыйКод));	
	КонецЦикла;
	Сообщить("Обработка завершена. Перекодировано: " + Формат(Кол,"ЧГ=0"));
КонецПроцедуры

ТекстЗ = "ВЫБРАТЬ ПЕРВЫЕ 80
         |	Контрагенты.Ссылка КАК Ссылка,
         |	Контрагенты.Код КАК Код,
         |	Контрагенты.Наименование КАК Наименование,
         |	Контрагенты.ЭтоГруппа КАК ЭтоГруппа,
         |	Контрагенты.Наименование КАК Наименование1,
         |	ВложенныйЗапрос.КолвоДублей КАК КолвоДублей
         |ИЗ
         |	(ВЫБРАТЬ ПЕРВЫЕ 80
         |		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Контрагенты.Ссылка) КАК КолвоДублей,
         |		Контрагенты.Код КАК Код
         |	ИЗ
         |		Справочник.Контрагенты КАК Контрагенты
         |	ГДЕ
         |		НЕ Контрагенты.ЭтоГруппа
         |	
         |	СГРУППИРОВАТЬ ПО
         |		Контрагенты.Код
         |	
         |	УПОРЯДОЧИТЬ ПО
         |		КолвоДублей УБЫВ) КАК ВложенныйЗапрос
         |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
         |		ПО ВложенныйЗапрос.Код = Контрагенты.Код
         |ГДЕ
         |	ВложенныйЗапрос.КолвоДублей > 1";
