
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	Отчет = Новый ТабличныйДокумент;
	МакетОформления = ЭтотОбъект.ПолучитьМакет("Макет");
	Шапка = МакетОформления.ПолучитьОбласть("Шапка");
	Шапка.Параметры.ДатаИВремя = ТекущаяДата();
	Шапка.Параметры.Синоним = Метаданные.Синоним;
	Шапка.Параметры.Версия = Метаданные.Версия;

	Отчет.Вывести(Шапка);
	ЕстьОшибки = Ложь;
	
	Для каждого Проверка Из ТаблицаПроверок Цикл
		Если Проверка.Проверять Тогда
			Если	ПустаяСтрока(СокрЛП(Проверка.ВидПроверки)) Тогда
				Сообщить("Не определен вид проверки в строке: " + Формат(Проверка.НомерСтроки + 1, "ЧГ=0"), СтатусСообщения.Информация);	
			ИначеЕсли ВРег(СокрЛП(Проверка.ВидПроверки)) = ВРег(СокрЛП("1. Дублирование кодов в справочниках")) Тогда
				СтруктураПараметров = ПроверитьДублиКодовСправочников(Отчет);
				ЕстьОшибки = СтруктураПараметров.ЕстьДубли;
				
			ИначеЕсли ВРег(СокрЛП(Проверка.ВидПроверки)) = ВРег(СокрЛП("2. Разсинхронизация в предопределенных элементах справочника 'СкладыКомпании'")) Тогда	
				СтруктураПараметров = ПроверитьКорректностьСправочникаСкладыКомпании(Отчет);
				ЕстьОшибки = СтруктураПараметров.ЕстьОшибки;
				
			ИначеЕсли ВРег(СокрЛП(Проверка.ВидПроверки)) = ВРег(СокрЛП("3. Разсинхронизация в предопределенных элементах справочника 'Номенклатура'")) Тогда	
				СтруктураПараметров = ПроверитьКорректностьСправочникаНоменклатура(Отчет);
				ЕстьОшибки = СтруктураПараметров.ЕстьОшибки;
				
			ИначеЕсли ВРег(СокрЛП(Проверка.ВидПроверки)) = ВРег(СокрЛП("4. Разсинхронизация в предопределенных элементах справочника 'Контрагенты'")) Тогда	
				СтруктураПараметров = ПроверитьКорректностьСправочникаКонтрагенты(Отчет);
				ЕстьОшибки = СтруктураПараметров.ЕстьОшибки;
				
			ИначеЕсли ВРег(СокрЛП(Проверка.ВидПроверки)) = ВРег(СокрЛП("5. Проверка заполнения обязательных реквизитов в основных справочниках")) Тогда	
				СтруктураПараметров = ПроверитьЗаполнениеСправочников(Отчет);
				ЕстьОшибки = СтруктураПараметров.ЕстьОшибки;
				
			Иначе
				Сообщить("Проверка: " + Проверка.ВидПроверки + " не предусмотрена! Строка: " + Формат(Проверка.НомерСтроки + 1, "ЧГ=0"), СтатусСообщения.Информация);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	
	ПодсчетСправочниковВыполнен = ПодсчетСправочников(Отчет);
	
	Отчет.Показать("Проверка корректности данных в базе-источнике.");
КонецПроцедуры

Процедура КнопкаЗаполнитьТаблицуПроверокНажатие(Элемент)
	ЗаполнитьВидыПроверок();
КонецПроцедуры

Процедура ПриОткрытии()
	НаДату = ТекущаяДата();
	Если ТаблицаПроверок.Количество() = 0 Тогда
		ЗаполнитьВидыПроверок();
	КонецЕсли; 
КонецПроцедуры
