
Процедура КнопкаВыполнитьНажатие(Кнопка)
	
	//ситуации, когда автомобиль в остатках разъехался на несколько партий
	Если флПроверитьКорректностьОстатковТоварныхАвтомобилей Тогда
		ПроверитьКорректностьОстатковТоварныхАвтомобилей();
	КонецЕсли;
	
	//ситуации, когда ордерные остатки хранятся на обычном складе
	Если флПроверитьКорректностьОстатковТоварныхАвтомобилей Тогда
	
		
	КонецЕсли; 
	
	//когда право 'КонтролироватьСоответствиеОрганизацииПодразделения' отключено - в базе-источники могут быть данные которые на загрузятся в приемник.
	//Вообще наверное надо синхронизировать настройки и права
	Если флПроверитьСправочникиСНеправильнойПривязкойОрганизацийИПодразделений Тогда
	
		
	
	КонецЕсли; 
	
КонецПроцедуры

Функция ПроверитьКорректностьОстатковТоварныхАвтомобилей()
	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОстаткиАвтомобилейОстатки.СкладКомпании КАК СкладКомпании,
	|	ОстаткиАвтомобилейОстатки.Автомобиль КАК Автомобиль,
	|	СУММА(ОстаткиАвтомобилейОстатки.КоличествоОстаток) КАК Количество,
	|	СУММА(ОстаткиАвтомобилейОстатки.СуммаОстаток) КАК Сумма,
	|	СУММА(ОстаткиАвтомобилейОстатки.СуммаНДСОстаток) КАК СуммаНДС,
	|	СУММА(ОстаткиАвтомобилейОстатки.СуммаУпрОстаток) КАК СуммаУпр,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОстаткиАвтомобилейОстатки.Партия) КАК КоличествоПартий
	|ИЗ
	|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(&ДатаСведений, СтатусПартии = &НужныйСтатусПартии) КАК ОстаткиАвтомобилейОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Автомобили.СрезПоследних(&ДатаСведений, ВидЗначения = &ВидЗначенияВидАвтомобиля) КАК АвтомобилиСрезПоследних
	|		ПО ОстаткиАвтомобилейОстатки.Автомобиль = АвтомобилиСрезПоследних.Автомобиль
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиАвтомобилейОстатки.СкладКомпании,
	|	ОстаткиАвтомобилейОстатки.Автомобиль
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоПартий УБЫВ";
	
	Запрос = Новый Запрос();
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ДатаСведений", КонецДня(НаДату));
	Запрос.УстановитьПараметр("НужныйСтатусПартии", Перечисления.СтатусыПартий.ТоварКупленный);
	Запрос.УстановитьПараметр("ВидАвтомобиляСПробегом", Перечисления.ВидАвтомобиля.АвтомобильСПробегом);
	Запрос.УстановитьПараметр("ВидЗначенияВидАвтомобиля", Перечисления.ДополнительнаяИнформацияАвтомобилей.ВидАвтомобиля);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ПроблемныйАвтомобиль = Выборка.Автомобиль;	
		КоличествоПартий = Выборка.КоличествоПартий;
		СтрокаСообщения = "Проблема с остатками автомобилей. Как минимум, автомобиль: " + СокрЛП(ПроблемныйАвтомобиль) + " числится в остатке более чем по одной партии!
		|Более подробно можно посмотреть отчетом по остаткам автомобилей, с группировкой по автомобилям и партиям.
		|Скорее всего нарушена последовательность редактирования данных.
		|Сверка данных с новой программой после миграции будет затруднена, информация будет различаться.";
		Сообщить(СтрокаСообщения,СтатусСообщения.Важное);
	КонецЕсли; 
КонецФункции // ()
